bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_comm_mm.c
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <bl808_comm_mm.h>

#ifndef TRUE
#define TRUE  1
#endif
#ifndef FALSE
#define FALSE 0
#endif

int Mem_Size_To_Burst_Cnt(uint32_t mem_size, AXI_XLEN_E xlen)
{
	switch (xlen)
	{
        case AXI_XLEN_SINGLE:
        return mem_size >> 3;

        case AXI_XLEN_INCR4:
        return mem_size >> 5;

        case AXI_XLEN_INCR8:
        return mem_size >> 6;

        case AXI_XLEN_INCR16:
        return mem_size >> 7;

        case AXI_XLEN_INCR32:
        return mem_size >> 8;

        case AXI_XLEN_INCR64:
        return mem_size >> 9;

        default:
        BL_LOGE("mem_size_to_burst_cnt: invalid xlen %d!\n", xlen);
        return -1;
    }
}

int Burst_Cnt_To_Mem_Size(uint32_t mem_size, AXI_XLEN_E xlen)
{
	switch (xlen)
	{
        case AXI_XLEN_SINGLE:
        return mem_size << 3;

        case AXI_XLEN_INCR4:
        return mem_size << 5;

        case AXI_XLEN_INCR8:
        return mem_size << 6;

        case AXI_XLEN_INCR16:
        return mem_size << 7;

        case AXI_XLEN_INCR32:
        return mem_size << 8;

        case AXI_XLEN_INCR64:
        return mem_size << 9;

        default:
        BL_LOGE("burst_cnt_to_mem_size: invalid xlen %d!\n", xlen);
        return -1;
    }
}


